/****************************************************************************
 * Ardino综合项目: Aruino UNO平衡小车__3__定时器中断
 * Author: Benny
 * 功能：每间5ms发生一次中断，在中断里又使用中断次数计数，计数达到一定值后执行对应函数
****************************************************************************/
#include "./MsTimer2.h"           // 定时器中断函数库
int speedcc = 0;                  // 5ms中断次数计数

void setup() {
    Serial.begin(9600);
    MsTimer2::set(5, inter);     // 5ms定时中断执行inter函数
	MsTimer2::start();		     // 定时器中断开始
}

void loop() {

}
/****************************
 * 函数名称：inter()
 * 功能：定时器中断触发函数
 ****************************/
void inter() {
    sei() ;     // 打开中断，必须打开总中断
    speedcc++;  // 中断产生次数计数
    // 2s触发一次下面函数
    if(speedcc == 400 ) {
        Serial.println("触发定时器中断");
        speedcc = 0 ;
    }
}
